/**
 * @class 测试代码类
 *
 **/
//    执行代码测试
$(function () {
    //        准备gps log
    arrGpsLog = obtain_gps_endpoint(GPSLog);
    //获取gps log 的起点和终点
    function obtain_gps_endpoint(ArrGpsLog) {
        var gps = getGPSPoint(ArrGpsLog), obj = {};
        obj.start = {
            x:gps[0].longitude,
            y:gps[0].latitude
        };
        obj.end = {
            x:gps[gps.length - 1].longitude,
            y:gps[gps.length - 1].latitude
        };
        return gps;
    }

//    只在我的电脑上进行测试
//    var localMachine = location.href.match(/^(http:\/\/)?(localhost|127.0.0.1)\/NGI\/navigate\//) ? true : false;
    if (typeof localStorage['ngi_test_state'] == 'undefined') {
        return;
    }
    var localMachine = JSON.parse(localStorage['ngi_test_state'] || false);
    if (localMachine != true) {
        return;
    }
//    return;
    var constant = GLOBAL.Constant;
//    主界面测试
//    现象出现时，弹出提示
//导航测试
    setInterval(TestClass.testNavState, 1000);
    if (GLOBAL.Constant) {
        var obj = {
            tbt_request_fail:false,
            /**
             * @default 1表示从开始请求算路到现在最大请求时间为1秒, 默认15
             */
            tbt_timeout_interval:15,
            //测试请求路径时的起始点是否重合
            test_start_end_superposition:false,
            /**
             * @GLOBAL.Constant 设置使用gps log模拟导航
             */
            tbt_gpsLog_state:false,
            /**
             * @GLOBAL.Constant 设置gps log模拟导航是否循环进行
             */
            tbt_gpsLog_loop:true,
            /**
             * @GLOBAL.Constant 测试第一次进入项目
             */
            test_last_nav:true,
            /**
             * @GLOBAL.Constant 使用GPS Log点模拟导航速度，1000毫秒传入一个gps点的值
             */
            tbt_simulateGpsSpeed:10,
            test_btn_state:'block',
            /**
             @requires sdk链接
             */
            source_sdk_link_01:"http://apiv3.test.mapabc.com/map.js?key=f9bc6d756c9176716881e278638e0bb8f5bd78ddeb4ac3033e8ab3591e0fcefa8c26ce3fd36d5a0f",
            source_sdk_link_02:"http://apis.mapabc.com/webapi/auth.json?t=ajaxmap&v=3.0&key=f6c97a7f64063cfee7c2dc2157847204d4dbf093f42472345fce56979d1e9c292144138b89993c81",
            addLoadJsTime:3000
        };
        $.each(obj, function (i, n) {
            GLOBAL.Constant[i] = n;
        });
    }
    //    直接进入周边检索页面
//    $('#rim').click();
//    $('#search img:first').click();
//    $('#four_s').click();
//    $('#four_s').click();
    TestClass.displayTestBtn();
    TestClass.autoTest();
    $('#testBtn')
        .css({
            width:150,
            position:'absolute',
            top:0,
            left:70,
            'z-index':9999
//                    display:GLOBAL.Constant.test_btn_state
        })
        .children('input')
        .css({
            width:150,
            height:50
        });
    $('#test')
        .css({
            position:'absolute',
            top:0,
            left:290,
            'z-index':1001
        });
})
;
var TestClass = {
    testNavState:function () {
        TestClass.testRemainDistVal();

    },
//    测试DGNaviInfor.nSegRemainDist是否为空字符串
    testRemainDistVal:function () {
        var val = $('#remain_distance').html();
        if (GLOBAL.Event.NGIStateManager.getCurrentState() == "Navigation" && $.trim(val) == '') {
            var error = new Error('remain distance is empty string');
            var err = new GLOBAL.common.error.ErrorMsgToServer(error);
            err.pushMessage();
        }
    },
    autoTest:function () {

        this.verifyPoiDisplay();
//        this.verifyImgUiEffect();
        this.verifyPathId();
//        目前该方法无效
        this.verifyTMCReroute();
    },
//    验证路径路况页面光柱图片点击后是否生成错误，即没有设置为无背景图片
    verifyImgClickUiEffect:function (intervalId) {
        if (GLOBAL.Event.NGIStateManager.getCurrentState() != "TrafficCondition") {
            return;
        }
//         如果主界面按钮没有绑定事件，或者路径路况页面绑定了事件（与ui效果有关），则进行提示
        if ($('#light_cross img', frames[0].document).data("events") || !$("#menu_first").data("events")) {
            alert('image ui event binding error');
        }
        clearInterval(intervalId);
    },
//验证智能路线路况探测本地变量值
    verifyTMCReroute:function () {
        $('img[alt="返回按钮"]', frames[0].document).live('click', function () {
            if (Event.NGIStateManager.getCurrentState() == "TrafficInfoSetting") {
                alert(localStorage['TMCReroute']);
            }
        });
    },
//    验证放大缩小按钮时，双光柱页面path元素id的变化
    verifyPathId:function () {
        $('#zoom_out_light_cross, #zoom_in_light_cross').click(function () {
            var originId = $('path:first').attr('id');
            setTimeout(function () {
                var nowId = $('path:first').attr('id');
                if (nowId != originId) {
                    var err = new GLOBAL.common.error.ErrorMsgToServer(new Error('id of the first path changed'));
                    err.pushMessage();
                }
            }, 3000);
        });
    },
//    验证路径路况页面构成光柱的图片点击事件
    verifyImgUiEffect:function () {
        var that = this;
        var callImgEvent = setInterval((function (func) {
            return function () {
                func(callImgEvent);
            }
        })(this.verifyImgClickUiEffect, callImgEvent), 1000);
    },
//    验证poidisplay result是否正确 TODO 目前该方法不可用，因为进入动态机状态变化时，该方法未执行
    verifyPoiDisplay:function () {
        if (!$('input[name=\'verify current poi\']').click()) {
            alert('poi display error');
        }
    },
//    显示测试按钮
    displayTestBtn:function () {
        var arr = [
            {
                value:'pause gps log simulation',
                click:function () {
                    clearInterval(GLOBAL.Constant.nav_obj.watchId);
                }
            },
            {
                value:'resume gps push',
                click:function () {
                    GLOBAL.Constant.tbt_gpsLog_state = true;
                    GLOBAL.Constant.nav_obj.watchId = GLOBAL.WatchGPS.prototype.inspectCurrentGPS();
                }
            },
            {
                value:'generate error',
                click:function () {
                    try {
//                        throw new SyntaxError('error');
                        undefinedFunc();
                    }
                    catch (e) {
                        alert(e.stack);
//                        测试playTTS未定义的异常是否被过滤掉，查看log.txt
                        var err = new GLOBAL.common.error.ErrorMsgToServer(new Error('playTTS00'));
                        err.pushMessage();
                    }
                }
            },
            {
                value:'get programe info',
                click:function () {
                    TestClass.displayComparePoints();
                }
            },
            {
                value:'add a favor in my home',
                click:function () {
                    var config = {
                        type:'我家',
                        name:'test',
                        lng:Math.random(),
                        lat:Math.random(),
                        address:'test',
                        tel:'test'
                    };
                    if (typeof checkBeforeSave === 'undefined') {
                        $.getScript('../main_menu/favorite/js/favoriteAdd.js', function () {
                            checkBeforeSave(config);
                        });
                    }
                    else {
                        checkBeforeSave(config);
                    }
                }
            },
            {
                value:'add a favor in history',
                click:function () {
                    var config = {
                        type:GLOBAL.Constant.favor_history,
                        name:'test',
                        lng:Math.random(),
                        lat:Math.random(),
                        address:'test',
                        tel:'test'
                    };
                    if (typeof checkBeforeSave === 'undefined') {
                        $.getScript('../main_menu/favorite/js/favoriteAdd.js', function () {
                            checkBeforeSave(config);
                        });
                    }
                    else {
                        checkBeforeSave(config);
                    }
                }
            },
            {
                value:'toggle display iframe',
                click:function () {
                    $(document).find('#iframeDiv').toggle();
                }
            },
            {
                value:'watch gps navigation state',
                click:function () {
//                TestClass.watchVar({
//                    left:this.tbt_remain_metre,
//                    right:Infinity
//                });
                    TestClass.judgeNavState(GLOBAL.Constant.nav_obj.naviStatus);
                }
            },
            {
                value:'verify current poi',
                name:'verify current poi',
                click:function () {
                    TestClass.outputInfo(GLOBAL.Constant.poi_search_result);
                    if (Event.NGIStateManager.getCurrentState() == GLOBAL.Constant.NGIStates.MapWithPoi) {
                        var bool = true;
                        if (GLOBAL.Constant.poi_search_result.name != $('#poi_current').val()) {
                            $('p:last').append('name display error');
                            bool = false;
                        }
//                    getCenter()方法只能获取经纬度小数点后8位
                        if (Event.mapObj.getCenter().lng != Number(GLOBAL.Constant.poi_search_result.lng).toFixed(8) || Event.mapObj.getCenter().lat != Number(GLOBAL.Constant.poi_search_result.lat).toFixed(8)) {
                            $('p:last').append('map center display error');
                            bool = false;
                        }
                        if (bool) {
                            $('p:last').append('poi display correctly');
                        }
                        return bool;
                    }
                }
            },
            {
                value:'draw two path',
                click:this.displayDoublePath
            },
            {
                value:'test wrapping with iframe',
                click:this.iframeWrapButton
            },
            {
                value:'throw error',
                click:function () {
                    try {
                        throw new Error('test');
                    } catch (e) {
                        var err = new GLOBAL.common.error.ErrorMsgToServer(e);
                        err.pushMessage();
                    }
                }
            },
            {
                value:'toggle prompt',
                click:function () {
                    $('#test p:last').is(':visible') ? $('#test p').hide() : $('#test p').show();
                }
            }
        ];
        $('body').append('<div id="testBtn"></div><div id="test"></div>');
        this.generateTestButton(arr);

    },
    displayDoublePath:function () {
        var normal = [
                {"lng":116.40702691, "lat":39.90421007},
                {"lng":116.40702691, "lat":39.90458333},
                {"lng":116.4069401, "lat":39.90629774},
                {"lng":116.40684028, "lat":39.90786892},
                {"lng":116.40683594, "lat":39.90786892},
                {"lng":116.40748264, "lat":39.90788194},
                {"lng":116.40807292, "lat":39.90789497},
                {"lng":116.41068142, "lat":39.90798177},
                {"lng":116.41151042, "lat":39.90799913},
                {"lng":116.41219184, "lat":39.90802083},
                {"lng":116.41380208, "lat":39.90806858},
                {"lng":116.41602865, "lat":39.90813802},
                {"lng":116.41793403, "lat":39.90819444},
                {"lng":116.41812066, "lat":39.90820313},
                {"lng":116.41893663, "lat":39.90821615},
                {"lng":116.41983507, "lat":39.90823785},
                {"lng":116.42121528, "lat":39.90826389},
                {"lng":116.42200087, "lat":39.90827691},
                {"lng":116.42290365, "lat":39.90829427},
                {"lng":116.42452691, "lat":39.90832465},
                {"lng":116.42696181, "lat":39.90838976},
                {"lng":116.42715278, "lat":39.90838976},
                {"lng":116.42728299, "lat":39.90838976},
                {"lng":116.42813802, "lat":39.9083941},
                {"lng":116.42897569, "lat":39.90840278},
                {"lng":116.4290842, "lat":39.90840712},
                {"lng":116.43052517, "lat":39.9084375},
                {"lng":116.43076823, "lat":39.90844184},
                {"lng":116.43224826, "lat":39.9084592},
                {"lng":116.43259983, "lat":39.90847656},
                {"lng":116.43352431, "lat":39.90848524},
                {"lng":116.43489583, "lat":39.9085026},
                {"lng":116.43539931, "lat":39.90849826},
                {"lng":116.43606337, "lat":39.90849826},
                {"lng":116.43671875, "lat":39.90849826},
                {"lng":116.43828993, "lat":39.90849392},
                {"lng":116.43953559, "lat":39.9084809},
                {"lng":116.44096354, "lat":39.90847656},
                {"lng":116.44102865, "lat":39.90846788},
                {"lng":116.44131944, "lat":39.90846354},
                {"lng":116.44215278, "lat":39.9084592},
                {"lng":116.44380642, "lat":39.90844618},
                {"lng":116.44588108, "lat":39.90842448},
                {"lng":116.44700521, "lat":39.90843316},
                {"lng":116.44757813, "lat":39.90842448},
                {"lng":116.44808594, "lat":39.90842014},
                {"lng":116.44888021, "lat":39.90842014},
                {"lng":116.4499566, "lat":39.9084158},
                {"lng":116.45023003, "lat":39.90841146},
                {"lng":116.45036024, "lat":39.90840278},
                {"lng":116.4515191, "lat":39.9083941},
                {"lng":116.45265625, "lat":39.90838108},
                {"lng":116.45472656, "lat":39.9083724},
                {"lng":116.45580729, "lat":39.90836372},
                {"lng":116.4559375, "lat":39.90835938},
                {"lng":116.45728299, "lat":39.90835938},
                {"lng":116.45809896, "lat":39.90835503},
                {"lng":116.45886719, "lat":39.90833767},
                {"lng":116.45925781, "lat":39.90833767},
                {"lng":116.46048611, "lat":39.90834635},
                {"lng":116.46068142, "lat":39.90834635},
                {"lng":116.46153212, "lat":39.90834635},
                {"lng":116.46213976, "lat":39.90834635},
                {"lng":116.46279514, "lat":39.90833333},
                {"lng":116.46388021, "lat":39.90830295},
                {"lng":116.46584201, "lat":39.90829427},
                {"lng":116.46761719, "lat":39.90827257},
                {"lng":116.46945747, "lat":39.90825087},
                {"lng":116.47298177, "lat":39.90823351},
                {"lng":116.47414063, "lat":39.90822917},
                {"lng":116.47588108, "lat":39.90820313},
                {"lng":116.47762153, "lat":39.90820313},
                {"lng":116.4778559, "lat":39.90820313},
                {"lng":116.47797309, "lat":39.90820313},
                {"lng":116.4824349, "lat":39.90815972},
                {"lng":116.48300781, "lat":39.90814236},
                {"lng":116.48370226, "lat":39.9081467},
                {"lng":116.48648438, "lat":39.90810764},
                {"lng":116.48682292, "lat":39.9081033},
                {"lng":116.49117622, "lat":39.90802517},
                {"lng":116.49455729, "lat":39.90796441},
                {"lng":116.49648003, "lat":39.90792535},
                {"lng":116.49742622, "lat":39.90793837},
                {"lng":116.49894531, "lat":39.90794271},
                {"lng":116.50221788, "lat":39.90790799},
                {"lng":116.5060026, "lat":39.90784722},
                {"lng":116.50755208, "lat":39.90784722},
                {"lng":116.50865885, "lat":39.9078342},
                {"lng":116.50948785, "lat":39.90781684},
                {"lng":116.51121962, "lat":39.90779514},
                {"lng":116.51174045, "lat":39.90778212},
                {"lng":116.5121224, "lat":39.90778212},
                {"lng":116.51530816, "lat":39.90775608},
                {"lng":116.51853733, "lat":39.90775174},
                {"lng":116.51934462, "lat":39.90778212},
                {"lng":116.51969618, "lat":39.9078125},
                {"lng":116.52043837, "lat":39.90788628},
                {"lng":116.52072483, "lat":39.90792101},
                {"lng":116.52101128, "lat":39.90797309},
                {"lng":116.52156684, "lat":39.9080816},
                {"lng":116.52428819, "lat":39.90864583},
                {"lng":116.52442708, "lat":39.90868056},
                {"lng":116.52486111, "lat":39.90877604},
                {"lng":116.52566406, "lat":39.90893663},
                {"lng":116.52640191, "lat":39.90905382},
                {"lng":116.52690538, "lat":39.90912326},
                {"lng":116.52739583, "lat":39.90917969},
                {"lng":116.52779948, "lat":39.90921441},
                {"lng":116.52817274, "lat":39.90924045},
                {"lng":116.52863715, "lat":39.90926649},
                {"lng":116.52944878, "lat":39.90928819},
                {"lng":116.53053819, "lat":39.90929253},
                {"lng":116.53263021, "lat":39.90925781},
                {"lng":116.53381076, "lat":39.90924479},
                {"lng":116.53539931, "lat":39.90920139},
                {"lng":116.53726128, "lat":39.90918403},
                {"lng":116.53893229, "lat":39.90916667},
                {"lng":116.53893229, "lat":39.90916233},
                {"lng":116.53928819, "lat":39.90911024},
                {"lng":116.53947049, "lat":39.90907552},
                {"lng":116.53966146, "lat":39.90904948},
                {"lng":116.54099826, "lat":39.90897569},
                {"lng":116.54109809, "lat":39.90896701},
                {"lng":116.54124132, "lat":39.90894531},
                {"lng":116.54157986, "lat":39.90887587},
                {"lng":116.54157986, "lat":39.90887153},
                {"lng":116.54182292, "lat":39.90874132},
                {"lng":116.54233941, "lat":39.90848958},
                {"lng":116.54257813, "lat":39.90835938},
                {"lng":116.54282118, "lat":39.90821615},
                {"lng":116.54293403, "lat":39.90813802},
                {"lng":116.54315104, "lat":39.90799913},
                {"lng":116.54333333, "lat":39.90786024},
                {"lng":116.54350694, "lat":39.90771267},
                {"lng":116.54382813, "lat":39.90742622},
                {"lng":116.54392795, "lat":39.90731771},
                {"lng":116.54424913, "lat":39.90693142},
                {"lng":116.54438368, "lat":39.90672309},
                {"lng":116.54447917, "lat":39.90656684},
                {"lng":116.54454427, "lat":39.90642795},
                {"lng":116.54469184, "lat":39.90608073},
                {"lng":116.54479167, "lat":39.90572917},
                {"lng":116.54484375, "lat":39.90548611},
                {"lng":116.5449566, "lat":39.9053125},
                {"lng":116.54509549, "lat":39.90450955},
                {"lng":116.54563802, "lat":39.90196615},
                {"lng":116.54611111, "lat":39.89963542},
                {"lng":116.54639323, "lat":39.89809462},
                {"lng":116.54663628, "lat":39.89685764},
                {"lng":116.54676649, "lat":39.89626736},
                {"lng":116.5472309, "lat":39.89396701},
                {"lng":116.54738281, "lat":39.89302083},
                {"lng":116.54746962, "lat":39.89245226},
                {"lng":116.5475434, "lat":39.89188802},
                {"lng":116.54786458, "lat":39.88936198},
                {"lng":116.54795573, "lat":39.88855903},
                {"lng":116.54820747, "lat":39.88647135},
                {"lng":116.54828993, "lat":39.88590278},
                {"lng":116.54840712, "lat":39.885},
                {"lng":116.54851997, "lat":39.88398003},
                {"lng":116.54861111, "lat":39.88279948},
                {"lng":116.54865017, "lat":39.8821224},
                {"lng":116.54867187, "lat":39.88144965},
                {"lng":116.54868924, "lat":39.88072483},
                {"lng":116.5487283, "lat":39.87634983},
                {"lng":116.54874132, "lat":39.87603299},
                {"lng":116.54875, "lat":39.8756033},
                {"lng":116.54875, "lat":39.87440538},
                {"lng":116.54873264, "lat":39.87396267},
                {"lng":116.5487283, "lat":39.87395833},
                {"lng":116.54862413, "lat":39.87361545},
                {"lng":116.54858507, "lat":39.8734809},
                {"lng":116.54855469, "lat":39.87334201},
                {"lng":116.54854167, "lat":39.87312934},
                {"lng":116.54852431, "lat":39.87300347},
                {"lng":116.54849392, "lat":39.87238715},
                {"lng":116.54843316, "lat":39.87211806},
                {"lng":116.54838976, "lat":39.87198785},
                {"lng":116.54831163, "lat":39.8718316},
                {"lng":116.54818142, "lat":39.87161024},
                {"lng":116.54802951, "lat":39.87140191},
                {"lng":116.54789931, "lat":39.87125},
                {"lng":116.54766927, "lat":39.87101997},
                {"lng":116.54766493, "lat":39.87101562},
                {"lng":116.54760851, "lat":39.8709158},
                {"lng":116.54691406, "lat":39.87018663},
                {"lng":116.5468316, "lat":39.87010851},
                {"lng":116.54667969, "lat":39.86993924},
                {"lng":116.54646701, "lat":39.86964844},
                {"lng":116.54641059, "lat":39.86955295},
                {"lng":116.54634983, "lat":39.86940538},
                {"lng":116.54631944, "lat":39.86929253},
                {"lng":116.54628038, "lat":39.8690842},
                {"lng":116.54628038, "lat":39.86891059},
                {"lng":116.5462934, "lat":39.86873698},
                {"lng":116.54633681, "lat":39.86855903},
                {"lng":116.54640191, "lat":39.8683941},
                {"lng":116.5464974, "lat":39.86824219},
                {"lng":116.54663628, "lat":39.86806424},
                {"lng":116.54678819, "lat":39.86791233},
                {"lng":116.5468967, "lat":39.86782118},
                {"lng":116.54703125, "lat":39.86773003},
                {"lng":116.54717882, "lat":39.86764757},
                {"lng":116.54733941, "lat":39.86756944},
                {"lng":116.54747396, "lat":39.86751736},
                {"lng":116.54768229, "lat":39.86745226},
                {"lng":116.54788628, "lat":39.86740885},
                {"lng":116.54800781, "lat":39.86739149},
                {"lng":116.54822483, "lat":39.86737413},
                {"lng":116.54848958, "lat":39.86737413},
                {"lng":116.54861979, "lat":39.86737847},
                {"lng":116.54876302, "lat":39.86740017},
                {"lng":116.54898003, "lat":39.86743924},
                {"lng":116.54918403, "lat":39.8675},
                {"lng":116.54942274, "lat":39.86759115},
                {"lng":116.54958333, "lat":39.86766059},
                {"lng":116.55066406, "lat":39.868125},
                {"lng":116.55115451, "lat":39.86833767},
                {"lng":116.55131944, "lat":39.86839844},
                {"lng":116.5515408, "lat":39.86847222},
                {"lng":116.55168837, "lat":39.86850694},
                {"lng":116.55188368, "lat":39.86855469},
                {"lng":116.55217448, "lat":39.86860677},
                {"lng":116.55234375, "lat":39.86862847},
                {"lng":116.55270833, "lat":39.86865451},
                {"lng":116.55299913, "lat":39.86866753},
                {"lng":116.55311198, "lat":39.86866753},
                {"lng":116.55320312, "lat":39.86867622},
                {"lng":116.55345486, "lat":39.8687283},
                {"lng":116.55676215, "lat":39.86856771},
                {"lng":116.55775174, "lat":39.86851128},
                {"lng":116.55775174, "lat":39.86850694},
                {"lng":116.55818142, "lat":39.86833767},
                {"lng":116.55940104, "lat":39.86828993},
                {"lng":116.5634809, "lat":39.86813368},
                {"lng":116.56370226, "lat":39.86812934},
                {"lng":116.56384115, "lat":39.86812934},
                {"lng":116.5640842, "lat":39.86812066},
                {"lng":116.56453559, "lat":39.8681033},
                {"lng":116.56690972, "lat":39.86801649},
                {"lng":116.56950087, "lat":39.86792535},
                {"lng":116.57116319, "lat":39.86789063},
                {"lng":116.57226563, "lat":39.86784722},
                {"lng":116.57246094, "lat":39.86783854},
                {"lng":116.57256944, "lat":39.86782552},
                {"lng":116.57268229, "lat":39.86779514},
                {"lng":116.57273437, "lat":39.86777344},
                {"lng":116.57285156, "lat":39.86769097},
                {"lng":116.57289497, "lat":39.86762153},
                {"lng":116.57292535, "lat":39.86756076},
                {"lng":116.57295573, "lat":39.86744792},
                {"lng":116.57297309, "lat":39.86733507},
                {"lng":116.57304253, "lat":39.86628472},
                {"lng":116.57318576, "lat":39.86528646},
                {"lng":116.57318576, "lat":39.86528212},
                {"lng":116.57381076, "lat":39.86535156},
                {"lng":116.57381076, "lat":39.86535156},
                {"lng":116.5739974, "lat":39.86414062},
                {"lng":116.57421007, "lat":39.86249566},
                {"lng":116.57424913, "lat":39.86249132},
                {"lng":116.57533854, "lat":39.86019965},
                {"lng":116.57554253, "lat":39.85973524},
                {"lng":116.57673611, "lat":39.8572092},
                {"lng":116.5768099, "lat":39.85699219},
                {"lng":116.5768099, "lat":39.85698785},
                {"lng":116.57818576, "lat":39.85712674},
                {"lng":116.57840712, "lat":39.85713542},
                {"lng":116.57996094, "lat":39.8572526},
                {"lng":116.58067708, "lat":39.85730903},
                {"lng":116.58171441, "lat":39.85739583},
                {"lng":116.58301215, "lat":39.85750868},
                {"lng":116.58456163, "lat":39.85763455},
                {"lng":116.58665799, "lat":39.8578125},
                {"lng":116.58771267, "lat":39.85789497},
                {"lng":116.58894965, "lat":39.85799913},
                {"lng":116.58962674, "lat":39.8580599},
                {"lng":116.59078559, "lat":39.85815538},
                {"lng":116.59078559, "lat":39.85815538},
                {"lng":116.59144531, "lat":39.85568142},
                {"lng":116.59203125, "lat":39.85309462},
                {"lng":116.59203125, "lat":39.85309028},
                {"lng":116.5931901, "lat":39.85320313},
                {"lng":116.59519097, "lat":39.85354601}
            ],
            rapid = [
                {"lng":116.40702691, "lat":39.90421007},
                {"lng":116.40702691, "lat":39.90458333},
                {"lng":116.4069401, "lat":39.90629774},
                {"lng":116.40684028, "lat":39.90786892},
                {"lng":116.40683594, "lat":39.90786892},
                {"lng":116.40748264, "lat":39.90788194},
                {"lng":116.40807292, "lat":39.90789497},
                {"lng":116.41068142, "lat":39.90798177},
                {"lng":116.41151042, "lat":39.90799913},
                {"lng":116.41219184, "lat":39.90802083},
                {"lng":116.41380208, "lat":39.90806858},
                {"lng":116.41602865, "lat":39.90813802},
                {"lng":116.41793403, "lat":39.90819444},
                {"lng":116.41812066, "lat":39.90820313},
                {"lng":116.41893663, "lat":39.90821615},
                {"lng":116.41983507, "lat":39.90823785},
                {"lng":116.42121528, "lat":39.90826389},
                {"lng":116.42200087, "lat":39.90827691},
                {"lng":116.42290365, "lat":39.90829427},
                {"lng":116.42452691, "lat":39.90832465},
                {"lng":116.42696181, "lat":39.90838976},
                {"lng":116.42715278, "lat":39.90838976},
                {"lng":116.42728299, "lat":39.90838976},
                {"lng":116.42813802, "lat":39.9083941},
                {"lng":116.42897569, "lat":39.90840278},
                {"lng":116.4290842, "lat":39.90840712},
                {"lng":116.43052517, "lat":39.9084375},
                {"lng":116.43076823, "lat":39.90844184},
                {"lng":116.43224826, "lat":39.9084592},
                {"lng":116.43259983, "lat":39.90847656},
                {"lng":116.43352431, "lat":39.90848524},
                {"lng":116.43489583, "lat":39.9085026},
                {"lng":116.43539931, "lat":39.90849826},
                {"lng":116.43606337, "lat":39.90849826},
                {"lng":116.43671875, "lat":39.90849826},
                {"lng":116.43828993, "lat":39.90849392},
                {"lng":116.43953559, "lat":39.9084809},
                {"lng":116.44096354, "lat":39.90847656},
                {"lng":116.44102865, "lat":39.90846788},
                {"lng":116.44131944, "lat":39.90846354},
                {"lng":116.44215278, "lat":39.9084592},
                {"lng":116.44380642, "lat":39.90844618},
                {"lng":116.44588108, "lat":39.90842448},
                {"lng":116.44700521, "lat":39.90843316},
                {"lng":116.44757813, "lat":39.90842448},
                {"lng":116.44808594, "lat":39.90842014},
                {"lng":116.44888021, "lat":39.90842014},
                {"lng":116.4499566, "lat":39.9084158},
                {"lng":116.45023003, "lat":39.90841146},
                {"lng":116.45036024, "lat":39.90840278},
                {"lng":116.4515191, "lat":39.9083941},
                {"lng":116.45265625, "lat":39.90838108},
                {"lng":116.45472656, "lat":39.9083724},
                {"lng":116.45580729, "lat":39.90836372},
                {"lng":116.4559375, "lat":39.90835938},
                {"lng":116.45728299, "lat":39.90835938},
                {"lng":116.45809896, "lat":39.90835503},
                {"lng":116.45886719, "lat":39.90833767},
                {"lng":116.45925781, "lat":39.90833767},
                {"lng":116.46048611, "lat":39.90834635},
                {"lng":116.46068142, "lat":39.90834635},
                {"lng":116.46153212, "lat":39.90834635},
                {"lng":116.46213976, "lat":39.90834635},
                {"lng":116.46279514, "lat":39.90833333},
                {"lng":116.46388021, "lat":39.90830295},
                {"lng":116.46584201, "lat":39.90829427},
                {"lng":116.46761719, "lat":39.90827257},
                {"lng":116.46945747, "lat":39.90825087},
                {"lng":116.47298177, "lat":39.90823351},
                {"lng":116.47414063, "lat":39.90822917},
                {"lng":116.47588108, "lat":39.90820313},
                {"lng":116.47762153, "lat":39.90820313},
                {"lng":116.4778559, "lat":39.90820313},
                {"lng":116.47797309, "lat":39.90820313},
                {"lng":116.4824349, "lat":39.90815972},
                {"lng":116.48300781, "lat":39.90814236},
                {"lng":116.48370226, "lat":39.9081467},
                {"lng":116.48648438, "lat":39.90810764},
                {"lng":116.48682292, "lat":39.9081033},
                {"lng":116.49117622, "lat":39.90802517},
                {"lng":116.49455729, "lat":39.90796441},
                {"lng":116.49648003, "lat":39.90792535},
                {"lng":116.49742622, "lat":39.90793837},
                {"lng":116.49894531, "lat":39.90794271},
                {"lng":116.50221788, "lat":39.90790799},
                {"lng":116.5060026, "lat":39.90784722},
                {"lng":116.50755208, "lat":39.90784722},
                {"lng":116.50865885, "lat":39.9078342},
                {"lng":116.50948785, "lat":39.90781684},
                {"lng":116.51121962, "lat":39.90779514},
                {"lng":116.51174045, "lat":39.90778212},
                {"lng":116.5121224, "lat":39.90778212},
                {"lng":116.51530816, "lat":39.90775608},
                {"lng":116.51853733, "lat":39.90775174},
                {"lng":116.51934462, "lat":39.90778212},
                {"lng":116.51969618, "lat":39.9078125},
                {"lng":116.52043837, "lat":39.90788628},
                {"lng":116.52072483, "lat":39.90792101},
                {"lng":116.52101128, "lat":39.90797309},
                {"lng":116.52156684, "lat":39.9080816},
                {"lng":116.52428819, "lat":39.90864583},
                {"lng":116.52442708, "lat":39.90868056},
                {"lng":116.52486111, "lat":39.90877604},
                {"lng":116.52566406, "lat":39.90893663},
                {"lng":116.52640191, "lat":39.90905382},
                {"lng":116.52690538, "lat":39.90912326},
                {"lng":116.52739583, "lat":39.90917969},
                {"lng":116.52779948, "lat":39.90921441},
                {"lng":116.52817274, "lat":39.90924045},
                {"lng":116.52863715, "lat":39.90926649},
                {"lng":116.52944878, "lat":39.90928819},
                {"lng":116.53053819, "lat":39.90929253},
                {"lng":116.53263021, "lat":39.90925781},
                {"lng":116.53381076, "lat":39.90924479},
                {"lng":116.53539931, "lat":39.90920139},
                {"lng":116.53726128, "lat":39.90918403},
                {"lng":116.53893229, "lat":39.90916667},
                {"lng":116.53893229, "lat":39.90916233},
                {"lng":116.53928819, "lat":39.90911024},
                {"lng":116.53947049, "lat":39.90907552},
                {"lng":116.53966146, "lat":39.90904948},
                {"lng":116.54099826, "lat":39.90897569},
                {"lng":116.54109809, "lat":39.90896701},
                {"lng":116.54124132, "lat":39.90894531},
                {"lng":116.54157986, "lat":39.90887587},
                {"lng":116.54157986, "lat":39.90887153},
                {"lng":116.54182292, "lat":39.90874132},
                {"lng":116.54233941, "lat":39.90848958},
                {"lng":116.54257813, "lat":39.90835938},
                {"lng":116.54282118, "lat":39.90821615},
                {"lng":116.54293403, "lat":39.90813802},
                {"lng":116.54315104, "lat":39.90799913},
                {"lng":116.54333333, "lat":39.90786024},
                {"lng":116.54350694, "lat":39.90771267},
                {"lng":116.54382813, "lat":39.90742622},
                {"lng":116.54392795, "lat":39.90731771},
                {"lng":116.54424913, "lat":39.90693142},
                {"lng":116.54438368, "lat":39.90672309},
                {"lng":116.54447917, "lat":39.90656684},
                {"lng":116.54454427, "lat":39.90642795},
                {"lng":116.54469184, "lat":39.90608073},
                {"lng":116.54479167, "lat":39.90572917},
                {"lng":116.54484375, "lat":39.90548611},
                {"lng":116.5449566, "lat":39.9053125},
                {"lng":116.54509549, "lat":39.90450955},
                {"lng":116.54563802, "lat":39.90196615},
                {"lng":116.54611111, "lat":39.89963542},
                {"lng":116.54639323, "lat":39.89809462},
                {"lng":116.54663628, "lat":39.89685764},
                {"lng":116.54676649, "lat":39.89626736},
                {"lng":116.5472309, "lat":39.89396701},
                {"lng":116.54738281, "lat":39.89302083},
                {"lng":116.54746962, "lat":39.89245226},
                {"lng":116.5475434, "lat":39.89188802},
                {"lng":116.54786458, "lat":39.88936198},
                {"lng":116.54795573, "lat":39.88855903},
                {"lng":116.54820747, "lat":39.88647135},
                {"lng":116.54828993, "lat":39.88590278},
                {"lng":116.54840712, "lat":39.885},
                {"lng":116.54851997, "lat":39.88398003},
                {"lng":116.54861111, "lat":39.88279948},
                {"lng":116.54865017, "lat":39.8821224},
                {"lng":116.54867187, "lat":39.88144965},
                {"lng":116.54868924, "lat":39.88072483},
                {"lng":116.5487283, "lat":39.87634983},
                {"lng":116.54874132, "lat":39.87603299},
                {"lng":116.54875, "lat":39.8756033},
                {"lng":116.54875, "lat":39.87440538},
                {"lng":116.54873264, "lat":39.87396267},
                {"lng":116.5487283, "lat":39.87395833},
                {"lng":116.54862413, "lat":39.87361545},
                {"lng":116.54858507, "lat":39.8734809},
                {"lng":116.54855469, "lat":39.87334201},
                {"lng":116.54854167, "lat":39.87312934},
                {"lng":116.54852431, "lat":39.87300347},
                {"lng":116.54849392, "lat":39.87238715},
                {"lng":116.54843316, "lat":39.87211806},
                {"lng":116.54838976, "lat":39.87198785},
                {"lng":116.54831163, "lat":39.8718316},
                {"lng":116.54818142, "lat":39.87161024},
                {"lng":116.54802951, "lat":39.87140191},
                {"lng":116.54789931, "lat":39.87125},
                {"lng":116.54766927, "lat":39.87101997},
                {"lng":116.54766493, "lat":39.87101562},
                {"lng":116.54760851, "lat":39.8709158},
                {"lng":116.54691406, "lat":39.87018663},
                {"lng":116.5468316, "lat":39.87010851},
                {"lng":116.54667969, "lat":39.86993924},
                {"lng":116.54646701, "lat":39.86964844},
                {"lng":116.54641059, "lat":39.86955295},
                {"lng":116.54634983, "lat":39.86940538},
                {"lng":116.54631944, "lat":39.86929253},
                {"lng":116.54628038, "lat":39.8690842},
                {"lng":116.54628038, "lat":39.86891059},
                {"lng":116.5462934, "lat":39.86873698},
                {"lng":116.54633681, "lat":39.86855903},
                {"lng":116.54640191, "lat":39.8683941},
                {"lng":116.5464974, "lat":39.86824219},
                {"lng":116.54663628, "lat":39.86806424},
                {"lng":116.54678819, "lat":39.86791233},
                {"lng":116.5468967, "lat":39.86782118},
                {"lng":116.54703125, "lat":39.86773003},
                {"lng":116.54717882, "lat":39.86764757},
                {"lng":116.54733941, "lat":39.86756944},
                {"lng":116.54747396, "lat":39.86751736},
                {"lng":116.54768229, "lat":39.86745226},
                {"lng":116.54788628, "lat":39.86740885},
                {"lng":116.54800781, "lat":39.86739149},
                {"lng":116.54822483, "lat":39.86737413},
                {"lng":116.54848958, "lat":39.86737413},
                {"lng":116.54861979, "lat":39.86737847},
                {"lng":116.54876302, "lat":39.86740017},
                {"lng":116.54898003, "lat":39.86743924},
                {"lng":116.54918403, "lat":39.8675},
                {"lng":116.54942274, "lat":39.86759115},
                {"lng":116.54958333, "lat":39.86766059},
                {"lng":116.55066406, "lat":39.868125},
                {"lng":116.55115451, "lat":39.86833767},
                {"lng":116.55131944, "lat":39.86839844},
                {"lng":116.5515408, "lat":39.86847222},
                {"lng":116.55168837, "lat":39.86850694},
                {"lng":116.55188368, "lat":39.86855469},
                {"lng":116.55217448, "lat":39.86860677},
                {"lng":116.55234375, "lat":39.86862847},
                {"lng":116.55270833, "lat":39.86865451},
                {"lng":116.55299913, "lat":39.86866753},
                {"lng":116.55311198, "lat":39.86866753},
                {"lng":116.55320312, "lat":39.86867622},
                {"lng":116.55345486, "lat":39.8687283},
                {"lng":116.55676215, "lat":39.86856771},
                {"lng":116.55775174, "lat":39.86851128},
                {"lng":116.55824219, "lat":39.86849826},
                {"lng":116.56163628, "lat":39.86837674},
                {"lng":116.56346788, "lat":39.86831163},
                {"lng":116.56384115, "lat":39.86830295},
                {"lng":116.56644965, "lat":39.86820747},
                {"lng":116.57210503, "lat":39.86794705},
                {"lng":116.57299479, "lat":39.86792101},
                {"lng":116.57440104, "lat":39.86786024},
                {"lng":116.57442274, "lat":39.8678559},
                {"lng":116.57570313, "lat":39.86780382},
                {"lng":116.57707031, "lat":39.86775608},
                {"lng":116.57898438, "lat":39.86768663},
                {"lng":116.57960503, "lat":39.86766059},
                {"lng":116.57960503, "lat":39.86765625},
                {"lng":116.58328125, "lat":39.86751736},
                {"lng":116.5875, "lat":39.86737847},
                {"lng":116.58912326, "lat":39.86730469},
                {"lng":116.59286458, "lat":39.86715278},
                {"lng":116.59614149, "lat":39.86703559},
                {"lng":116.59878472, "lat":39.86690104},
                {"lng":116.5994401, "lat":39.866875},
                {"lng":116.59989149, "lat":39.86684462},
                {"lng":116.60111111, "lat":39.86673177},
                {"lng":116.60302517, "lat":39.86645399},
                {"lng":116.6046441, "lat":39.86620226},
                {"lng":116.60730469, "lat":39.86550781},
                {"lng":116.60961806, "lat":39.86479167},
                {"lng":116.6103125, "lat":39.86451389},
                {"lng":116.61186632, "lat":39.86387587},
                {"lng":116.61269965, "lat":39.86348524},
                {"lng":116.61331163, "lat":39.86318142},
                {"lng":116.61517795, "lat":39.86214844},
                {"lng":116.62428819, "lat":39.85704427},
                {"lng":116.62428819, "lat":39.85703993},
                {"lng":116.6249349, "lat":39.85655816},
                {"lng":116.62505208, "lat":39.85644965},
                {"lng":116.62511285, "lat":39.85635417},
                {"lng":116.62513455, "lat":39.85626736},
                {"lng":116.62514323, "lat":39.85620226},
                {"lng":116.62514323, "lat":39.85609375},
                {"lng":116.62513021, "lat":39.85600694},
                {"lng":116.62507813, "lat":39.85589844},
                {"lng":116.62503906, "lat":39.85584201},
                {"lng":116.6249783, "lat":39.85578125},
                {"lng":116.62481337, "lat":39.85567708},
                {"lng":116.62453125, "lat":39.85554688},
                {"lng":116.62421007, "lat":39.85546007},
                {"lng":116.62412326, "lat":39.85545139},
                {"lng":116.62295573, "lat":39.85537326},
                {"lng":116.62286024, "lat":39.85536892},
                {"lng":116.6228559, "lat":39.85536458},
                {"lng":116.62279514, "lat":39.85536458},
                {"lng":116.62228733, "lat":39.85535156},
                {"lng":116.62195747, "lat":39.85536458},
                {"lng":116.62166233, "lat":39.85539062},
                {"lng":116.62144097, "lat":39.85543403},
                {"lng":116.6212717, "lat":39.85548177},
                {"lng":116.62113281, "lat":39.85554253},
                {"lng":116.62101997, "lat":39.85560764},
                {"lng":116.6209375, "lat":39.85567274},
                {"lng":116.62072917, "lat":39.85588542},
                {"lng":116.62065104, "lat":39.85590712},
                {"lng":116.61976128, "lat":39.85527778},
                {"lng":116.61975694, "lat":39.85527344},
                {"lng":116.6196224, "lat":39.85539497},
                {"lng":116.61946181, "lat":39.85550347},
                {"lng":116.6193099, "lat":39.8555599},
                {"lng":116.61906684, "lat":39.85559462},
                {"lng":116.61817274, "lat":39.85559462},
                {"lng":116.61760851, "lat":39.85561198},
                {"lng":116.61744792, "lat":39.85563802},
                {"lng":116.61731337, "lat":39.85568576},
                {"lng":116.61722656, "lat":39.85575087},
                {"lng":116.61715712, "lat":39.85584201},
                {"lng":116.61711372, "lat":39.8559592},
                {"lng":116.61706163, "lat":39.85618924},
                {"lng":116.61691406, "lat":39.85717014},
                {"lng":116.61678385, "lat":39.85835503},
                {"lng":116.61671875, "lat":39.85877604},
                {"lng":116.61667101, "lat":39.8589974},
                {"lng":116.61661892, "lat":39.85917969},
                {"lng":116.6165191, "lat":39.85931424},
                {"lng":116.61631944, "lat":39.85950087},
                {"lng":116.61616753, "lat":39.85957899},
                {"lng":116.61597656, "lat":39.85963542},
                {"lng":116.61571615, "lat":39.85967014},
                {"lng":116.61541233, "lat":39.85967014},
                {"lng":116.61305556, "lat":39.85957465},
                {"lng":116.61305122, "lat":39.85957031},
                {"lng":116.61305122, "lat":39.85937934},
                {"lng":116.61303819, "lat":39.85923177},
                {"lng":116.61299913, "lat":39.85909288},
                {"lng":116.6128776, "lat":39.85875434},
                {"lng":116.61287326, "lat":39.85875},
                {"lng":116.60754774, "lat":39.85616319},
                {"lng":116.60691406, "lat":39.85585069},
                {"lng":116.60644531, "lat":39.85564236},
                {"lng":116.60608073, "lat":39.85554253},
                {"lng":116.60552517, "lat":39.85543837},
                {"lng":116.60407552, "lat":39.85518663},
                {"lng":116.60181858, "lat":39.85476128},
                {"lng":116.59950521, "lat":39.85428819},
                {"lng":116.59893229, "lat":39.85418403},
                {"lng":116.59672743, "lat":39.8538151},
                {"lng":116.59551649, "lat":39.85360677},
                {"lng":116.59519531, "lat":39.85355035}
            ];
        Event.mapObj.clearOverlaysByType('polyline');
        GLOBAL.Constant.nav_obj.rapidPathArray = rapid;
        GLOBAL.Constant.nav_obj.normalPathArray = normal;
//        var config = {
//            num:GLOBAL.Constant.iNum_Route,
//            highLightId:GLOBAL.Constant.iRapid,
//            line:GLOBAL.Constant.iStrokeColor
//        };
////        var drawLine = new RenderLine(config);
//        drawLine.chooseOrder();
        MapEvent.drawMultiPath([GLOBAL.Constant.iNormal, GLOBAL.Constant.iRapid])
        $('#fastSection, #normalSection, #fastLine, #normalLine').click(thisPage.selectPathEle);
//        Event.mapObj.setFitView();
        var pathArray = MapEvent.getPathArray();
        GLOBAL.common.MapUtil.setPathZoom(Event.mapObj, pathArray);
    },
//    测试iframe包含项目代码按钮
    iframeWrapButton:function () {
        location.href = "../iframeWrap.html";
    },
//    生成测试按钮
    generateTestButton:function (arr) {
        $.each(arr, function (i, config) {
            var event = config.click ? 'click' : 'toggle',
                handler = config.click || config.toggle;
            $('<input>', {
                value:config.value,
                type:'button',
                event:handler
//                click:config.click,
//                toggle:config.toggle
            })
                [event](function () {
                handler();
            })
                .appendTo('#testBtn');
        })
    },
//  添加对自车、目的地、当前兴趣点显示及比较方法（test.js中）
    displayComparePoints:function () {
        var points = {
            'automata state':Event.NGIStateManager.getCurrentState(),
            'Map_lng':localStorage['Map_lng'],
            'Map_lat':localStorage['Map_lat'],
            'map center longitude':Event.mapObj.getCenter().lng,
            'map center latitude':Event.mapObj.getCenter().lat,
            'Map_poi_lng':localStorage['Map_poi_lng'],
            'Map_poi_lat':localStorage['Map_poi_lat'],
            'Map_lng == Map_poi_lng && Map_lat == Map_poi_lat':localStorage['Map_lng'] == localStorage['Map_poi_lng'] && localStorage['Map_lat'] == localStorage['Map_poi_lat'],
            'current car at center':Event.mapObj.getOverlays('current').position.lng == Event.mapObj.getCenter().lng && Event.mapObj.getOverlays('current').position.lat == Event.mapObj.getCenter().lat,
            'current car position':Event.mapObj.getOverlays('current').position.lng + ',' + Event.mapObj.getOverlays('current').position.lat,
            'iframe src':frames[0].window.document.location.href,
            'GLOBAL.Constant.rimeSearchType':GLOBAL.Constant.rimeSearchType,
            'Event.mapObj.getOverlaysByType(\'polyline\').length':Event.mapObj.getOverlaysByType('polyline').length
        };
        var config = {
            saved:GLOBAL.Constant.points || GLOBAL.Constant.points,
            current:points,
            str:''
        };
        this.outputInfo(points);
//        this.findChangedVal(config);
//        TODO 以后要替换成使用动态机状态判定的方法
        GLOBAL.Constant.points = points;
        GLOBAL.Constant.points = points;
    },
    outputInfo:function (obj) {
        var str = '', expression = obj;
        if (typeof expression == 'object') {
            $.each(expression, function (i, n) {
                if (n instanceof Object) {
                    if ($.isEmptyObject(n)) {
                        str += i + ' is empty object {}<br>';
                    }
                    for (var p in n) {
                        if (n[p] instanceof Object) {
                            arguments.callee(expression[p]);
                        }
                        else {
                            str += p + ' : ' + n[p] + '<br />';
                        }
                    }
                }
                else {
                    if ($.trim(n) === '') {
                        str += i + ' is empty string \'\'<br>';
                    }
                    else {
                        str += i + ' : ' + n + '<br />';
                    }
                }
            });
        }
        else {
            str = expression;
        }
//        if ($('#test p').length > 0) {
//            $('#test p')
//                .show();
//        }
        if ($.trim(str) !== '') {
            $('<p>', {
                html:str
            })
                .appendTo('#test');
        }
        else {
            console.log('no change or no value');
        }
    },
//    比较两个参数是否相等，或引用对象的属性及值完全相同
    findChangedVal:function (config) {
        var str = config.str || '', objA = config.saved, objB = config.current, result = false;
//        如果是第一次进入程序，还未初始化变量GLOBAL.Constant.points，则直接输出GLOBAL.Constant.points
        if (typeof objA == 'undefined') {
            if (this.outputInfo) {
                this.outputInfo(objB);
            }
            return;
        }

        //对象
        if (typeof objA == 'object' && typeof objB == 'object') {
            for (var o in objA) {
                //判断两个对象的同名属性是否相同（数字或字符串）
                if (typeof objA[o] == 'number' || typeof objA[o] == 'string' || typeof objA[o] == 'boolean') {
                    result = eval(objA[o] == objB[o]);
                    if (!result) {
                        str += o + ' : ' + objB[o] + '<br>';
                    }
                }
                else {
                    //如果对象的属性值也是对象，则递归判断两个对象的同名属性
                    var configProp = {
                        current:objB[o],
                        saved:objA[o],
                        str:str
                    };
                    str = arguments.callee(configProp);
                }
            }
            if (config.str == '') {
                return str;
            }
            TestClass.outputInfo(str);
        }
    },
    //以下为遍历JS对象的方法，常用于调试
    traverseObj:function (obj) {
        var temp = '';
        for (var parm in obj) {
            if (typeof(obj[parm]) == "object") {
                temp += "属性：'" + parm + "' 子属性：<br/>";
                var dData = obj[parm];
                for (var tparm in dData) {
                    temp += "--属性： '" + tparm + "' 值：" + dData[tparm] + "<br>";
                }
            } else {
                temp += "属性：'" + parm + "' 值：" + obj[parm] + "<br>";
            }
        }
        document.getElementById("result").innerHTML = temp;
    },
    /**
     * @description 判断地图中心、自车覆盖物中心是否重合，中心上是否有polyline覆盖物上的点
     */
    determineCenterCurrentPolyline:function () {
        var current = Event.mapObj.getOverlays('current'),
            center = Event.mapObj.getCenter(),
            polyline = Event.mapObj.getOverlaysByType('polyline')[0],
            bool = 0;
        if (current.position.lng == center.lng && current.position.lat == center.lat) {
            $.each(polyline, function (i, n) {
                $.each(n, function (p, q) {
                    if (q.lng == center.lng && q.lat == center.lat) {
                        bool = 1;
                        return false;
                    }
                });
                if (bool == 1) {
                    return false;
                }
            });
        }
        if (!bool) {
            console.log('movement locus error');
        }
    },

//    监视变量值
    watchVar:function (config) {
        if (config && config.left && config.right) {
            this.outputInfo('expression:(' + config.left + '==' + config.right + ') is ' + (config.left == config.right));
        }
        else {
            this.outputInfo(config)
        }
    },
    judgeNavState:function (status) {
        this.outputInfo(status)
    }
};
var UseTime = {
    time1:'',
    time2:'',
    startTime:function () {
        var date = new Date();
        this.time1 = date.getTime();
        console.log('start time:' + this.time1);
    },
    endTime:function () {
        var date = new Date();
        this.time2 = date.getTime();
        console.log('  end time:' + this.time2);
        console.log('  use time:' + (this.time2 - this.time1) + 'ms');
    }
};

/**
 @class 动态加载js文件，同时判断了网络连接状况
 */
TestClass.AddloadJsFile = function (config) {
    if (config) {
        this.js_1 = config.js_1 || GLOBAL.Constant.source_sdk_link_01;
        this.js_2 = config.js_2 || GLOBAL.Constant.source_sdk_link_02;
        this.eventJsFile = config.eventJsFile;
        this.timeout = config.timeout || GLOBAL.Constant.addLoadJsTime;
        /**
         @deprecated 暂未实现
         @description 回调函数是请求sdk js文件成功后执行的函数，主界面的回调是加载init_local.js,加载地图、路径等
         */
            //this.callbackSuccess = config.callbackSuccess;
        this.callbackError = config.callbackError
        /**
         @public 声明了一个全局变量，应优化成类的私有变量
         */
        that = this;
    }
};
TestClass.AddloadJsFile.that = this;
TestClass.AddloadJsFile.prototype = {
    addJs:function () {
        try {
            $.ajax({
                url:that.js_1,
                dataType:"script",
                /**
                 * @throws 请求超时这个参数通常就保留其默认值，要不就通过jQuery.ajaxSetup来全局设定，很少为特定的请求重新设置timeout选项。这里如设置可能会造成同时加载了两个sdk js 文件
                 */
                timeout:that.timeout || GLOBAL.Constant.addLoadJsTime,
                success:that.success,
                error:that.error,
                /**
                 * @property {bool} 设置为 false 将不缓存此页面,防止加载两个js文件
                 */
                cache:false
            });
        }
        catch (e) {
            console.log(e.message);
        }
    },
//        动态加载js文件，发布时可删除
    addIniFile:function () {
        if (that.eventJsFile instanceof Array) {
            $.each(that.eventJsFile, function (i, n) {
                $.getScript(n);
            });
        }
        else {
            $.getScript(that.eventJsFile);
        }
    },
    success:function (data, textStatus) {
        if (that.addIniFile instanceof Function) {
            try {
                that.addIniFile();
            }
            catch (e) {
                console.log(e.message);
            }
        }
        console.log('loaded js file : %s', that.js_1);
    },
    error:function () {
        $.getScript(that.js_2, function (response, status) {
            if (status === 'success') {
                that.addIniFile();
                console.log('loaded js file : %s', that.js_2);
                //return;
            }
            else {
                that.callbackError();
            }
        });
    }
}